#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mmodule.charts-import.null_resource.import_charts["ping-devops"]: Refreshing state... [id=6003950240642911284][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # module.charts-import.helm_release.deployments["ping-devops"][0m will be created
[0m  [32m+[0m[0m resource "helm_release" "deployments" {
      [32m+[0m[0m atomic                     = false
      [32m+[0m[0m chart                      = "ping-devops"
      [32m+[0m[0m cleanup_on_fail            = false
      [32m+[0m[0m create_namespace           = false
      [32m+[0m[0m dependency_update          = false
      [32m+[0m[0m disable_crd_hooks          = false
      [32m+[0m[0m disable_openapi_validation = false
      [32m+[0m[0m disable_webhooks           = false
      [32m+[0m[0m force_update               = false
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m lint                       = false
      [32m+[0m[0m manifest                   = (known after apply)
      [32m+[0m[0m max_history                = 0
      [32m+[0m[0m metadata                   = (known after apply)
      [32m+[0m[0m name                       = "ping-devops"
      [32m+[0m[0m namespace                  = "default"
      [32m+[0m[0m pass_credentials           = false
      [32m+[0m[0m recreate_pods              = false
      [32m+[0m[0m render_subchart_notes      = true
      [32m+[0m[0m replace                    = false
      [32m+[0m[0m repository                 = "instance.azurecr.io"
      [32m+[0m[0m reset_values               = false
      [32m+[0m[0m reuse_values               = false
      [32m+[0m[0m skip_crds                  = false
      [32m+[0m[0m status                     = "deployed"
      [32m+[0m[0m timeout                    = 300
      [32m+[0m[0m verify                     = false
      [32m+[0m[0m version                    = "0.9.19"
      [32m+[0m[0m wait                       = true
      [32m+[0m[0m wait_for_jobs              = false

      [32m+[0m[0m set {
          [32m+[0m[0m name  = "pingfederate-admin.enabled"
          [32m+[0m[0m value = "true"
        }
      [32m+[0m[0m set {
          [32m+[0m[0m name  = "pingfederate-engine.container.replicaCount"
          [32m+[0m[0m value = "5"
        }
      [32m+[0m[0m set {
          [32m+[0m[0m name  = "pingfederate-engine.enabled"
          [32m+[0m[0m value = "true"
        }
    }

[1m  # module.charts-import.null_resource.import_charts["ping-devops"][0m is tainted, so must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "null_resource" "import_charts" {
      [33m~[0m[0m id = "6003950240642911284" -> (known after apply)
    }

[1mPlan:[0m 2 to add, 0 to change, 1 to destroy.
[0m
Changes to Outputs:
  [31m-[0m[0m path_module = "." [90m-> null[0m[0m
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Pachinkos, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*